{"loss": "categorical_crossentropy", "optimizer": {"epsilon": 1e-08, "lr": 1.0, "name": "Adadelta", "rho": 0.95}, "class_name": "Model", "loss_weights": null, "keras_version": "1.0.6", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 19, 19, 12], "name": "x", "input_dtype": "float32"}, "inbound_nodes": [], "name": "x"}, {"class_name": "Convolution2D", "config": {"b_regularizer": null, "W_constraint": null, "b_constraint": null, "name": "convolution2d_1", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 5, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "input_dtype": "float32", "border_mode": "valid", "batch_input_shape": [null, 19, 19, 12], "W_regularizer": null, "activation": "relu", "nb_row": 5}, "inbound_nodes": [[["x", 0, 0]]], "name": "convolution2d_1"}, {"class_name": "BatchNormalization", "config": {"name": "batchnormalization_1", "epsilon": 1e-06, "trainable": true, "mode": 0, "momentum": 0.9, "axis": -1}, "inbound_nodes": [[["convolution2d_1", 0, 0]]], "name": "batchnormalization_1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_2", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["batchnormalization_1", 0, 0]]], "name": "convolution2d_2"}, {"class_name": "BatchNormalization", "config": {"name": "batchnormalization_2", "epsilon": 1e-06, "trainable": true, "mode": 0, "momentum": 0.9, "axis": -1}, "inbound_nodes": [[["convolution2d_2", 0, 0]]], "name": "batchnormalization_2"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_3", "activity_regularizer": null, "trainable": true, "dim_ordering": "tf", "nb_col": 3, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_row": 3}, "inbound_nodes": [[["batchnormalization_2", 0, 0]]], "name": "convolution2d_3"}, {"class_name": "BatchNormalization", "config": {"name": "batchnormalization_3", "epsilon": 1e-06, "trainable": true, "mode": 0, "momentum": 0.9, "axis": -1}, "inbound_nodes": [[["convolution2d_3", 0, 0]]], "name": "batchnormalization_3"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}, "inbound_nodes": [[["batchnormalization_3", 0, 0]]], "name": "flatten_1"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "out", "activity_regularizer": null, "trainable": true, "init": "he_normal", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "softmax", "output_dim": 361}, "inbound_nodes": [[["flatten_1", 0, 0]]], "name": "out"}], "input_layers": [["x", 0, 0]], "output_layers": [["out", 0, 0]], "name": "model_1"}, "sample_weight_mode": null}